def area(a, b):
    """
    Вычисляет площадь прямоугольника.

    Аргументы:
        a (float): первая сторона прямоугольника.
        b (float): вторая сторона прямоугольника.

    Возвращает:
        float: площадь прямоугольника.

    Пример вызова:
        >>> area(4, 5)
        20
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    Аргументы:
        a (float): первая сторона прямоугольника.
        b (float): вторая сторона прямоугольника.

    Возвращает:
        float: периметр прямоугольника.

    Пример вызова:
        >>> perimeter(4, 5)
        18
    """
    return 2 * (a + b)
